#+title: Live-wc for GNU Emacs
#+author: Pradyumna Swanand Paranjape
#+EMAIL: pradyparanjpe@rediffmail.com
#+language: en
#+options: ^:{} ':t toc:t author:t email:t num:t
#+PROPERTY: header-args :eval no
#+PROPERTY: LIVE-WC-TARGET -900
#+startup: overview
#+macro: 0.0.3
#+bind: org-html-htmlize-output-type css

#+texinfo_filename: live-wc.info
#+texinfo_dir_category: Individual utilities
#+texinfo_dir_title: Live-wc: (live-wc)
#+texinfo_dir_desc: Count text words in real time
#+texinfo_header: @set MAINTAINER Pradyparanjpe Paranjape
#+texinfo_header: @set MAINTAINEREMAIL @email{pradyparanjpe@rediffmail.com}
#+texinfo_header: @set MAINTAINERCONTACT @uref{mailto:pradyparanjpe@rediffmail.com,contact the maintainer}

#+texinfo: @insertcopying


** ~live-wc-idle-sec~
Default: (seconds)
#+begin_src emacs-lisp :exports results :eval t :results value code
(default-value 'live-wc-idle-sec)
#+end_src

#+RESULTS:
: 1

/Live-WC/ counters gather buffer-statistics (number of words, characters and lines) for the current buffer in the background, when Emacs is idle.
This variable sets the frequency.
If the gathered values are not consumed to generate /live-wc/'s mode-line segment, the counter assumes that nothing has happened since the last count, and runs =nop= (no operation).

** ~live-wc-max-buffer-size~
Default: (bytes)
#+begin_src emacs-lisp :exports results :eval t :results value code
  (default-value 'live-wc-max-buffer-size)
#+end_src

#+RESULTS:
: 1048576

Maximum size of buffer beyond which, word count is inactive.
This is conservatively set to 15kB.

** ~live-wc-line-pos~
Default: ~most-positive-fixnum~
#+begin_src emacs-lisp :exports results :eval t :results value code
  (default-value 'live-wc-line-pos)
#+end_src

#+RESULTS:
: 5

Insert /live-wc/ count at this position on mode line.
Indexing starts with =0=.
This value is auto clipped between =0= and existing number of segments in the mode line.
Consequently, a /large enough/ number such as ~most-positive-fixnum~ puts the segment at the end of the mode-line.

#+ATTR_TEXINFO: :tag Tip
#+ATTR_HTML: :tag Tip
#+begin_quote
The first two segments in the mode line are often ~%e~ and ~mode-line-front-space~.
So, /live-wc/ added at position =2= will appear at the beginning of an ordinary mode line.
#+end_quote

** ~live-wc-abs-format~
Default:
#+begin_src emacs-lisp :exports results :eval t :results value code
  (default-value 'live-wc-abs-format)
#+end_src

#+RESULTS:
: ¶:%d


Format string for live absolute word count.

** ~live-wc-frac-format~
Default:
#+begin_src emacs-lisp :exports results :eval t :results value code
  (default-value 'live-wc-frac-format)
#+end_src

#+RESULTS:
: ¶:%2.2f%%%%

Format string for live word count when expressed as a fraction (percentage).

#+ATTR_TEXINFO: :tag Warning
#+ATTR_HTML: :tag Warning
#+begin_quote
Remember to sufficiently skip =%= symbols.
#+end_quote

** ~live-wc-bright~
Default:
#+begin_src emacs-lisp :exports results :eval t :results value code
  (default-value 'live-wc-bright)
#+end_src

#+RESULTS:
: 1.0

Brightness of /live-wc/ fraction. Interval: =[0.0, 1.0]=

